{
  "backend/main.mo": "Motoko actor defining product, service, client, appointment, and portfolio-photo types with CRUD operations and ID counters for a salon management backend.",
  "feature_evidence.json": "Feature evidence report mapping high-level product features to related frontend files and components.",
  "frontend-file-summaries.txt": "Text file listing short descriptions of all major frontend components, pages, hooks, and styles.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH color variables for light/dark themes and global styling.",
  "frontend/index.html": "Main HTML entry point with Portuguese metadata and root mount point for the React app.",
  "frontend/src/App.tsx": "App component handling navigation across the four main pages and rendering layout and toast system.",
  "frontend/src/components/agenda/AppointmentFormDialog.tsx": "Modal form for creating new appointments with client/service selection, time, and notes.",
  "frontend/src/components/agenda/AppointmentListItem.tsx": "UI card for displaying appointment details including time, client, service, status, and notes.",
  "frontend/src/components/brand/BrandHeader.tsx": "Header showing salon monogram and wordmark images with a premium branding label.",
  "frontend/src/components/clientes/ClientDetailPanel.tsx": "Displays detailed client info with tabs for preferences, allergies, and appointment history pulled from agenda and services hooks.",
  "frontend/src/components/clientes/ClientFormDialog.tsx": "Dialog form for creating a new client with validation and submission via useClientesMutations.",
  "frontend/src/components/estoque/ProductFormDialog.tsx": "Dialog form to add a product to inventory, including validation for numeric fields and submitting via useEstoqueMutations.",
  "frontend/src/components/estoque/StockAdjustDialog.tsx": "Dialog for increasing or decreasing a product's stock quantity with validation and update via useEstoqueMutations.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout with sidebar navigation, header, footer, and container for rendering page content.",
  "frontend/src/components/servicos/ServiceFormDialog.tsx": "Dialog form to create a new service with validated duration and price fields using useServicosMutations.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and invalidates related queries when it changes.",
  "frontend/src/hooks/useAgenda.ts": "Fetches and filters appointments by date and provides mutations for creating new appointments.",
  "frontend/src/hooks/useClientes.ts": "Loads all clients and provides a mutation for adding new clients.",
  "frontend/src/hooks/useEstoque.ts": "Fetches products and provides mutations to add products or update quantities.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login state, stored identities, and exposes identity context to the app.",
  "frontend/src/hooks/useQueries.ts": "Provides a minimal backend health check query using the actor.",
  "frontend/src/hooks/useServicos.ts": "Loads all services, filters active ones, and provides mutations to add services or toggle status.",
  "frontend/src/index.css": "Defines Tailwind base styles and a premium gold-themed light/dark design system with custom utilities.",
  "frontend/src/main.tsx": "Initializes React root and wraps the app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AgendaDeHojePage.tsx": "Renders the daily agenda view with date navigation and appointment listing/creation UI.",
  "frontend/src/pages/CatalogoDeServicosPage.tsx": "UI page for listing, searching, creating, and toggling active status of services with price and duration formatting.",
  "frontend/src/pages/ControleDeEstoquePage.tsx": "Inventory management page enabling product search, low‑stock filtering, creation, and stock adjustment dialogs.",
  "frontend/src/pages/FidelidadeClientesPage.tsx": "Client loyalty page with search, client list, creation dialog, and detail panel selection handling.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing app features, requirements, design notes, and existing implemented functionality."
}