{
  "backend/main.mo": "Primary Motoko canister defining admin credentials, access control, data models, counters, and CRUD state maps, including admin login verification.",
  "backend/migration.mo": "Migration module copying old actor state while resetting adminPassword to 'joana 123'.",
  "feature_evidence.json": "Feature evidence report mapping credential-related feature requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "List of concise summaries for various frontend components, pages, and hooks.",
  "frontend/index.css": "Tailwind CSS base variables and dark-mode theme definitions for the frontend.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React application.",
  "frontend/src/App.tsx": "Main React component routing between pages and rendering the application layout.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Wrapper component that restricts access to admin-only areas based on permissions and password validation.",
  "frontend/src/components/admin/AdminPasswordDialog.tsx": "Admin login modal that trims only outer whitespace and verifies credentials using useAdminPasswordGate.",
  "frontend/src/components/agenda/AppointmentFormDialog.tsx": "Dialog form for creating appointments, handling client/service selection, date/time input, and submission via agenda mutations.",
  "frontend/src/components/agenda/AppointmentListItem.tsx": "Displays appointment details including status, time, client, service, and notes in a styled card.",
  "frontend/src/components/brand/BrandHeader.tsx": "Renders the application header with logo images and a small tagline.",
  "frontend/src/components/clientes/ClientDetailPanel.tsx": "Shows client details, preferences, and appointment history using tabs and service lookup.",
  "frontend/src/components/clientes/ClientFormDialog.tsx": "Dialog for adding a new client with fields for contact info, preferences, and allergies, submitting through client mutations.",
  "frontend/src/components/estoque/ProductCard.tsx": "Card displaying product info, stock levels, low‑stock warning, and a quick adjustment button.",
  "frontend/src/components/estoque/ProductFormDialog.tsx": "Dialog form to add new inventory products with validation and submission via estoque mutation hooks.",
  "frontend/src/components/estoque/StockAdjustDialog.tsx": "Dialog for increasing or decreasing a product's stock with validation and mutation handling.",
  "frontend/src/components/expenses/IncomeVsExpensesBarChart.tsx": "Renders a bar chart comparing income and expenses per month using Recharts.",
  "frontend/src/components/expenses/TransactionForm.tsx": "Form to add income or expense transactions with validation and mutation submission.",
  "frontend/src/components/home/HomeCategoryGrid.tsx": "Grid of home page category buttons that navigate to different app sections with icons.",
  "frontend/src/components/home/HomeHeroCarousel.tsx": "Image carousel for the home page with navigation arrows and slide indicators.",
  "frontend/src/components/home/WhatsAppFloatingButton.tsx": "Floating button that opens a WhatsApp chat link for contacting the business.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, content area, floating WhatsApp button, bottom navigation, and footer.",
  "frontend/src/components/servicos/ServiceCardListItem.tsx": "Service list item showing image, details, formatted price/duration, and a button to schedule.",
  "frontend/src/components/servicos/ServiceFormDialog.tsx": "Dialog form for creating a new service with validation, preset support, and submission via useServicosMutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useAdmin.ts": "Checks whether the current caller is an admin using the backend actor.",
  "frontend/src/hooks/useAdminPasswordGate.ts": "Handles admin password validation with session persistence and backend verification.",
  "frontend/src/hooks/useAgenda.ts": "Fetches appointments filtered by date and provides mutation for creating new appointments.",
  "frontend/src/hooks/useClientes.ts": "Defines client hooks; fetching returns empty list and mutations allow adding clients via backend.",
  "frontend/src/hooks/useEstoque.ts": "Fetches product inventory and provides mutations for adding products and updating quantities.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, authentication handling, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Minimal shared hook that checks backend health based on actor availability.",
  "frontend/src/hooks/useServicos.ts": "Fetches services, exposes active services, and provides mutations for adding and toggling service status.",
  "frontend/src/hooks/useTransactions.ts": "Fetches transactions, monthly aggregates, and provides mutations to add, update, and delete transactions.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes plus typography and texture styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminLandingPage.tsx": "Admin dashboard landing page showing navigation cards for inventory and expenses, gated by admin access.",
  "frontend/src/pages/AdminLoginPage.tsx": "Login form for admin access with username/password validation and navigation on success.",
  "frontend/src/pages/AgendaDeHojePage.tsx": "Displays daily appointments with date navigation and a dialog to create new appointments.",
  "frontend/src/pages/CatalogoDeServicosPage.tsx": "Manages service catalog with search, nails filter, service creation, and scheduling support.",
  "frontend/src/pages/ControleDeEstoquePage.tsx": "Admin-only inventory management page with search, low‑stock filtering, and product create/adjust dialogs.",
  "frontend/src/pages/ExpensesDashboardPage.tsx": "Renders an admin-gated expenses dashboard showing monthly income vs expenses and a form to add new transactions.",
  "frontend/src/pages/FidelidadeClientesPage.tsx": "Provides client search, listing, creation dialog, detail panel, and an owner-access button routing to admin inventory with validation.",
  "frontend/src/pages/HomePage.tsx": "Displays the home screen with hero carousel, welcome text, category grid navigation, and a WhatsApp CTA section.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, store, retrieve, and clear URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and plugins for the app’s design system.",
  "project_state.json": "Stores project metadata, UI/UX requirements, known issues, and existing feature definitions for the salon management app."
}