{
  "backend/main.mo": "Main Motoko canister defining access control, counters, types, and CRUD logic for users, products, services, clients, appointments, photos, and transactions.",
  "feature_evidence.json": "Lists implemented features with associated files, components, test IDs, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing pages, components, hooks, and styling.",
  "frontend/index.css": "Tailwind base/theme CSS defining color tokens, dark mode variables, and global styling.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, and mounting the React app root.",
  "frontend/src/App.tsx": "Main React app handling page navigation and layout with a bottom-nav structure and toast support.",
  "frontend/src/components/agenda/AppointmentFormDialog.tsx": "Modal form to create appointments with client/service selection, datetime inputs, and backend mutation.",
  "frontend/src/components/agenda/AppointmentListItem.tsx": "Displays appointment details with status badge, time, client, service, and notes.",
  "frontend/src/components/brand/BrandHeader.tsx": "Header showing salon monogram and wordmark logos with premium styling.",
  "frontend/src/components/clientes/ClientDetailPanel.tsx": "Displays a client's details and appointment history, pulling related services and formatting info in tabs.",
  "frontend/src/components/clientes/ClientFormDialog.tsx": "Dialog form for adding a new client with validation and mutation handling.",
  "frontend/src/components/estoque/ProductCard.tsx": "Shows a product's basic info, stock level, and triggers quick stock adjustment.",
  "frontend/src/components/estoque/ProductFormDialog.tsx": "Dialog form for adding products to inventory with numeric validation and mutation calls.",
  "frontend/src/components/estoque/StockAdjustDialog.tsx": "Dialog to increase or decrease a product's stock with validation and update logic.",
  "frontend/src/components/expenses/IncomeVsExpensesBarChart.tsx": "Renders a Recharts bar chart comparing monthly income and expenses.",
  "frontend/src/components/expenses/TransactionForm.tsx": "Form to create income or expense transactions with validation and mutation submission.",
  "frontend/src/components/home/HomeCategoryGrid.tsx": "Renders a grid of category buttons with icons that navigate to different PageView routes.",
  "frontend/src/components/home/HomeHeroCarousel.tsx": "Displays an auto-looping image carousel with navigation arrows and slide indicators.",
  "frontend/src/components/home/WhatsAppFloatingButton.tsx": "Provides a floating WhatsApp contact button linking to a preset chat message.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, content area, floating WhatsApp button, bottom navigation, and desktop footer.",
  "frontend/src/components/servicos/ServiceCardListItem.tsx": "Shows a service card with image, details, formatted duration and price, and an action button to schedule.",
  "frontend/src/components/servicos/ServiceFormDialog.tsx": "Implements a dialog form for adding new services with validation, presets, and backend submission.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refreshing queries when identity changes.",
  "frontend/src/hooks/useAdmin.ts": "Checks if the current authenticated user is an admin using the actor’s isCallerAdmin method.",
  "frontend/src/hooks/useAgenda.ts": "Fetches and filters appointments by status and date, and provides mutations to create new appointments.",
  "frontend/src/hooks/useClientes.ts": "Provides client list retrieval placeholder and mutations to add new clients through the actor.",
  "frontend/src/hooks/useEstoque.ts": "Fetches product inventory and exposes mutations for adding products and updating quantities.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth state, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines a simple backend health query using the actor from useActor and react-query.",
  "frontend/src/hooks/useServicos.ts": "Implements service list querying and status toggling plus mutations for adding services using react-query and the backend actor.",
  "frontend/src/hooks/useTransactions.ts": "Provides transaction list querying, monthly aggregate fetching, and mutations for adding, updating, and deleting transactions.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom theme variables for light/dark modes with typography and texture utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AgendaDeHojePage.tsx": "Renders the daily agenda page with date navigation, appointment list, and dialog for creating appointments.",
  "frontend/src/pages/CatalogoDeServicosPage.tsx": "Displays and filters the service catalog with search, nails filter, service cards, and dialogs for creating services or scheduling.",
  "frontend/src/pages/ControleDeEstoquePage.tsx": "Inventory control page with product filtering, low‑stock warnings, and dialogs for creating and adjusting products.",
  "frontend/src/pages/ExpensesDashboardPage.tsx": "Admin‑only expenses dashboard showing monthly aggregates, a bar chart, and a transaction form.",
  "frontend/src/pages/FidelidadeClientesPage.tsx": "Client management page with search, admin shortcuts, and dialogs for creating and viewing client details.",
  "frontend/src/pages/HomePage.tsx": "Homepage with hero carousel, category grid navigation, and a call‑to‑action to schedule services.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting hash‑based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and container settings for the project.",
  "project_state.json": "Defines the app’s state, design guidelines, and existing features for a luxury Portuguese salon-management app, including navigation, agenda, inventory, services, clients, and known domain validation issues."
}