{
  "backend/main.mo": "Main Motoko canister defining products, services, clients, appointments, transactions, user profiles, and admin authentication with AccessControl and storage mixins.",
  "feature_evidence.json": "Aggregated feature evidence report listing feature IDs, affected files, components, and test IDs for recent admin‑login and navigation changes.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and functionality of various frontend files across pages, hooks, and components.",
  "frontend/index.css": "Tailwind base/theme config defining color variables, dark‑mode tokens, and global background/foreground styling.",
  "frontend/index.html": "Base HTML entry point setting fonts, metadata, dark mode class, and loading the React main.tsx script.",
  "frontend/src/App.tsx": "Top-level React component managing page navigation state and rendering pages inside the AppLayout with toast support.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Guard component that checks frontend and backend admin authentication and redirects users to admin login when required.",
  "frontend/src/components/admin/AdminPasswordDialog.tsx": "Dialog for entering admin credentials, validating them via useAdminPasswordGate, and triggering success callbacks on valid login.",
  "frontend/src/components/agenda/AppointmentFormDialog.tsx": "Dialog form to create an appointment, selecting client, service, date, time, and notes, and submitting via agenda mutations.",
  "frontend/src/components/agenda/AppointmentListItem.tsx": "Displays a single appointment with status, time, client, service, and notes using UI cards and badges.",
  "frontend/src/components/brand/BrandHeader.tsx": "Header showing brand logo, wordmark, and a small tagline.",
  "frontend/src/components/clientes/ClientDetailPanel.tsx": "Client details panel showing profile info, preferences, allergies, and appointment history.",
  "frontend/src/components/clientes/ClientFormDialog.tsx": "Dialog form to add a new client with name, contact, preferences, and allergies.",
  "frontend/src/components/estoque/ProductCard.tsx": "Card displaying product info, stock levels, low‑stock warning, and a quick‑adjust button.",
  "frontend/src/components/estoque/ProductFormDialog.tsx": "Dialog form to add a new product with fields for metadata, quantities, thresholds, and supplier notes.",
  "frontend/src/components/estoque/StockAdjustDialog.tsx": "Modal form allowing increasing or decreasing product stock with validation and mutation submission.",
  "frontend/src/components/expenses/IncomeVsExpensesBarChart.tsx": "Renders a responsive bar chart comparing monthly income and expenses using Recharts.",
  "frontend/src/components/expenses/TransactionForm.tsx": "Form to create income or expense transactions with validation and mutation handling.",
  "frontend/src/components/home/HomeCategoryGrid.tsx": "Grid of category buttons that navigate to different pages with icons and fallbacks.",
  "frontend/src/components/home/HomeHeroCarousel.tsx": "Image carousel with auto-updating indicators using a UI carousel component.",
  "frontend/src/components/home/WhatsAppFloatingButton.tsx": "Floating button linking to WhatsApp with a preset message.",
  "frontend/src/components/layout/AppLayout.tsx": "App shell with header, content area, WhatsApp button, bottom navigation, and desktop footer.",
  "frontend/src/components/servicos/ServiceCardListItem.tsx": "Displays service info with duration and price formatting plus a button to schedule it.",
  "frontend/src/components/servicos/ServiceFormDialog.tsx": "Dialog form component for creating a new service with validation, preset support, and submission via useServicosMutations.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on Internet Identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useAdmin.ts": "Hook that checks whether the current caller is admin by querying actor.isCallerAdmin with react-query.",
  "frontend/src/hooks/useAdminPasswordGate.ts": "Client-side admin password gate storing auth state in sessionStorage and verifying credentials through the actor.",
  "frontend/src/hooks/useAgenda.ts": "Hooks for fetching appointments by status/date and creating new appointments via actor mutations.",
  "frontend/src/hooks/useClientes.ts": "Hooks for listing clients (currently empty due to missing backend method) and adding new clients through actor mutations.",
  "frontend/src/hooks/useEstoque.ts": "Hooks for fetching product inventory and adding/updating products via actor mutations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, storage, and status using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Minimal hook to check backend health using the actor.",
  "frontend/src/hooks/useServicos.ts": "Hooks for listing services, toggling service status, and adding new services via actor mutations.",
  "frontend/src/hooks/useTransactions.ts": "Provides React Query hooks for fetching and mutating transactions and monthly aggregates using the actor backend.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes with typography and texture overlays.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/AdminLandingPage.tsx": "Renders the admin landing dashboard with navigation cards for inventory and expense management.",
  "frontend/src/pages/AdminLoginPage.tsx": "Implements admin login form with credential validation and permission checking before navigation.",
  "frontend/src/pages/AgendaDeHojePage.tsx": "Displays daily appointment management with date navigation and creation dialog.",
  "frontend/src/pages/CatalogoDeServicosPage.tsx": "Shows a filterable and searchable service catalog with creation and scheduling dialogs.",
  "frontend/src/pages/ControleDeEstoquePage.tsx": "Admin-only inventory management page with product search, low‑stock alerts, and dialogs for creating and adjusting products.",
  "frontend/src/pages/ExpensesDashboardPage.tsx": "Admin expenses dashboard showing monthly income vs expenses and a form for adding new transactions.",
  "frontend/src/pages/FidelidadeClientesPage.tsx": "Client management page with search, client creation, detail panel, and a prominent 'PAINEL DO DONO' admin access button.",
  "frontend/src/pages/HomePage.tsx": "Public home page with hero carousel, categories grid, and a WhatsApp CTA for booking services.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and theme settings for the project.",
  "project_state.json": "Project metadata describing app purpose, UI guidelines, known issues, and architectural notes."
}