{
  "kind": "build_request",
  "title": "Add 'Nails Designer' support as a first-class service discovery & creation path",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Add a dedicated, prominent 'Nails Designer' quick filter on the Services Catalog page that, when selected, filters the list to services matching nails/manicure terms and clearly indicates the filter is active (with a one-tap way to clear it).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Tem como adicionar nails Designer"
        ]
      },
      "acceptanceCriteria": [
        "On the Services Catalog page, there is a visible quick filter labeled \"Nails Designer\".",
        "Tapping the quick filter updates the visible service list using the existing client-side filtering (name/description) without requiring backend changes.",
        "The UI shows the filter is active (e.g., selected pill state) and provides a single tap to clear/reset back to the unfiltered list.",
        "No changes are made to the bottom tab bar (it remains exactly 4 tabs)."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Allow creating a 'Nails Designer' service faster by adding an optional preset entry point from the existing 'Add Service' flow that pre-fills the service name with 'Nails Designer' (leaving duration/price to be entered by the admin).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Tem como adicionar nails Designer"
        ]
      },
      "acceptanceCriteria": [
        "From the Service creation dialog, the admin can trigger a preset that fills the Name field with \"Nails Designer\".",
        "The preset does not auto-fill price or duration (admin must still provide valid values per existing validation).",
        "Submitting the form creates the service using the existing addService mutation and it appears in the Services Catalog list afterward."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only).",
    "Do not modify any files listed in frontend.immutablePaths.",
    "Keep backend architecture as a single Motoko actor; do not introduce additional backend services.",
    "Do not change the fixed bottom navigation to add a 5th tab (it must remain exactly 4 tabs).",
    "User-facing text in this build request is English (implementation UI language may remain Portuguese per app requirements)."
  ],
  "nonGoals": [
    "Do not implement a new standalone 'Nails Designer' page or a new bottom navigation destination.",
    "Do not add third-party integrations (booking platforms, payments, messaging, etc.).",
    "Do not change the backend Service schema (e.g., adding a category field) as part of this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}