{
  "kind": "build_request",
  "title": "Fix admin login credentials to joana/joana123 (no space) and unblock Admin panel access",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-47",
      "text": "Update admin credential validation to accept ONLY username \"joana\" and password \"joana123\" (no internal space) end-to-end, aligning frontend verification (useAdminPasswordGate) with backend verification (verifyAdminLogin).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "refaca toda estrutura de codigos e corrija usuario joana e senha joana123 sem espaco e em seguida libere acesso ao painel do admin ok?"
        ]
      },
      "acceptanceCriteria": [
        "Calling frontend admin login with username \"joana\" and password \"joana123\" succeeds.",
        "Calling frontend admin login with username \"joana\" and password \"joana 123\" (with a space) fails.",
        "Calling backend verifyAdminLogin(\"joana\",\"joana123\") returns true.",
        "Calling backend verifyAdminLogin(\"joana\",\"joana 123\") returns false."
      ]
    },
    {
      "id": "REQ-48",
      "text": "Ensure a successful admin login reliably grants backend admin permissions for the current caller and refreshes any cached admin checks so AdminAccessGate immediately allows entry to admin pages after login.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...em seguida libere acesso ao painel do admin ok?"
        ]
      },
      "acceptanceCriteria": [
        "After a successful login (joana/joana123), the next isCallerAdmin check returns true for the same session/identity without requiring a redeploy.",
        "After successful login, navigating to Inventory and Expenses pages renders admin functionality (no access denied screen).",
        "If verifyAdminLogin returns true but isCallerAdmin remains false after refetch, the UI shows an error and does not navigate into admin pages."
      ]
    },
    {
      "id": "REQ-49",
      "text": "Remove any frontend logic that hardcodes or assumes the old spaced password (\"joana 123\"), including strict checks and any copy/error flows that depend on the old credential spec, while keeping the existing admin session persistence behavior (sessionStorage state: isAuthenticated/role).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...corrija usuario joana e senha joana123 sem espaco..."
        ]
      },
      "acceptanceCriteria": [
        "No frontend file rejects the correct password \"joana123\" due to legacy checks for \"joana 123\".",
        "Admin session state persists in sessionStorage as before (admin_auth_state with isAuthenticated=true and role='admin') after successful login.",
        "Clearing validation/logging out resets isAuthenticated to false and role to null and re-blocks admin pages."
      ]
    },
    {
      "id": "REQ-50",
      "text": "Validate the end-to-end navigation flow for owner/admin access: Profile \"PAINEL DO DONO\" -> Admin Login (when not validated) -> Inventory (after successful login), and ensure AdminAccessGate provides a clear path to Admin Login when blocked.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...libere acesso ao painel do admin ok?"
        ]
      },
      "acceptanceCriteria": [
        "When admin session is not validated, tapping \"PAINEL DO DONO\" navigates to the Admin Login page.",
        "When admin session is validated, tapping \"PAINEL DO DONO\" navigates directly to Inventory.",
        "If a user lands on an admin page without being authenticated, AdminAccessGate shows an auth-required state and provides a working button to navigate to Admin Login.",
        "If authenticated but lacking backend admin permission, AdminAccessGate offers a working re-login action that clears validation and routes to Admin Login."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/immutablePaths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if introducing new stable state that requires migration."
  ],
  "nonGoals": [
    "Do not redesign the app UI/theme or change unrelated salon-management features (agenda, services, clients, inventory data model) beyond what is needed to fix admin login/access.",
    "Do not add third-party authentication providers; keep Internet Identity + the existing manual admin credential flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}