{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Nails Designer quick filter + preset creation in Services flow",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Add a prominent 'Nails Designer' quick filter on the Services Catalog page with active state indication and one-tap clear/reset, using existing client-side filtering logic.",
      "acceptanceCriteria": [
        "On the Services Catalog page, there is a visible quick filter labeled \"Nails Designer\".",
        "Tapping the quick filter updates the visible service list using the existing client-side filtering (name/description) without requiring backend changes.",
        "The UI shows the filter is active (e.g., selected pill state) and provides a single tap to clear/reset back to the unfiltered list.",
        "No changes are made to the bottom tab bar (it remains exactly 4 tabs)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CatalogoDeServicosPage.tsx",
          "operation": "modify",
          "description": "Add a dedicated quick-filter control labeled \"Nails Designer\" near the existing search UI; introduce local state to track when the quick filter is active; apply an additional client-side match against nails/manicure-related keywords using the existing name/description string matching approach; render a clear/reset affordance (single tap) when active and a visually distinct selected state when enabled. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Add an optional preset action inside the existing Add Service dialog to prefill the service name with 'Nails Designer' without prefilling duration or price.",
      "acceptanceCriteria": [
        "From the Service creation dialog, the admin can trigger a preset that fills the Name field with \"Nails Designer\".",
        "The preset does not auto-fill price or duration (admin must still provide valid values per existing validation).",
        "Submitting the form creates the service using the existing addService mutation and it appears in the Services Catalog list afterward."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/servicos/ServiceFormDialog.tsx",
          "operation": "modify",
          "description": "Add a small optional preset entry point within the dialog (e.g., a button/secondary action) that sets only the Name field to \"Nails Designer\" while leaving description/duration/price unchanged; ensure existing validation remains enforced and submission continues to use the existing addService mutation + query invalidation so the new service appears in the catalog afterward. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}